[
  {
    "title": "Software Engineer Intern",
    "company": "CARS24",
    "period": "February 2025 - present",
    "location": "Gurugram, India",
    "details": [
      "Redesigned and implemented the Loan section in the Cars24 UAE Mobile app, expanding customer financing services by 40%.",
      "Developed engaging mobile screens using React Native Redux Toolkit and React Native Navigation to enhance the user experience.",
      "Developed an intuitive dual-path loan interface with seamless tab-switching functionality, improving user navigation by 25%.",
      "Implemented secure and responsive authentication flow for loan assistance requests, improving management efficiency by 35%.",
      "Collaborated effectively in agile development processes by participating in sprint planning, scrums, and detailed retrospectives.",
      "Promoted clean code practices and industry standards leading to a 50% reduction in bug reports and better code maintainability."
    ]
  },
  {
    "title": "Frontend Development Intern",
    "company": "Stealth Startup",
    "period": "Sept'24 - Feb' 2025",
    "location": "Texas, United States",
    "details": [
      "Architected a React Native iPad-based restaurant POS system with secure Bearer authentication and role-based access controls.",
      "Engineered a secure, configurable in-app settings module with PIN protection and auto-sleep authentication for security.",
      "Implemented dynamic customer management using useContext API, enabling streamlined and real-time order modifications.",
      "Designed an intuitive ordering interface with category-based menu navigation and item customization.",
      "Developed a versatile payment system supporting multi-tender transactions, including tips, surcharges, refunds, and split billing.",
      "Optimized app performance and ensured seamless offline functionality using AsyncStorage and RESTful API integration."
    ]
  },
  {
    "title": "Software Development Engineer Intern",
    "company": "Solidity Technologies",
    "period": "April'24 - July'24",
    "location": "Gurugram, India",
    "details": [
      "Contributed to mobile app development for a leading automotive industry company delivering intuitive user interfaces.",
      "Designed and implemented Finance First checkout flow driving a 30% increase in conversion rates for VIP users.",
      "Enhanced the app with geospatial feature leveraging react-native-maps and RESTful APIs for improved location-based services."
    ]
  },
  {
    "title": "Frontend Development Intern",
    "company": "Toko Dizital",
    "period": "March'24 - April'24",
    "location": "Indonesia",
    "details": [
      "Developed an automated Instagram content management system, integrating ChatGPT & DALL-E for creative content generation.",
      "Implemented Meta REST APIs to facilitate seamless posting and scheduling of Instagram content, enhancing social media workflow.",
      "Engineered custom VBScript and batch files to automate repetitive tasks, reducing manual workload by 60%"
    ]
  },
  {
    "title": "Research Intern",
    "company": "Defence Research and Development Organisation",
    "period": "Dec'22 - March'23",
    "location": "Delhi, India",
    "details": [
      "Developed and implemented GIS solutions using Java to enhance wargaming effectiveness and tactical simulations.",
      "Expanded knowledge by acquiring new graph-based algorithms for complex GIS applications.",
      "Collaborated with mentors to address algorithm performance challenges and conducted rigorous code validation and debugging."
    ]
  }
]
